Revit 2027 API
SchemaCommon.Category Property
 The property labeled "Category" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string Category { get; }
Public Shared ReadOnly Property Category As String
	Get
public:
static property String^ Category {
	String^ get ();
}
static member Category : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyString".
See Also
Reference
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace